<style lang="scss">

</style>
<template>
    <div class="home-page">
        <homePage 
            :config="config"
        />
    </div>
</template>
<script>
import homePage from "./home.vue";       // home

export default {  
    components: {
      homePage,
    },   
    data () {
        return {
            // 配置数据
            config:[
                {
                    // 头部
                    head:{
                        title:"大金MilkRun【闵行线路】H1车次-装车示意图-测试数据",   // 标题
                        date:"2020/7/8 8:30:00-测试数据",   // 交货日期
                        area:"1-3-测试数据",   // 车辆区分
                        principal:"张三 2020/07/08测试"  // 负责人
                    },
                    // 车厢 可以多个
                    children:[
                        {
                            titleLeft:"车头—F5",   // 左边 标题
                            titleRight:"车尾—F5",  // 右边边 标题
                            storageX:27,    // 货架区域 x 轴标尺数
                            scaleX:85,   // x 轴标尺数
                            scaleY:24,   // y 轴标尺数
                            // 左边盒子
                            boxLeft:[    
                                {
                                    width:10,    // 宽 （单位是 标尺）
                                    height:10,   // 高  （单位是 标尺）
                                    top:0,       // 距离上  （单位是 标尺）
                                    left:0,      // 距离左  （单位是 标尺）
                                    background: "rgba(0,255,255,1)",   // 颜色
                                    text:["1勤劳 → 一工厂","木质铲板×3","1000×1000×820","1000×800×850"]    // 文本
                                },
                                {
                                    width:11,    // 宽 （单位是 标尺）
                                    height:10,   // 高  （单位是 标尺）
                                    top:0,       // 距离上  （单位是 标尺）
                                    left:10,      // 距离左  （单位是 标尺）
                                    text:["1勤劳 → 一工厂","木质铲板×3","1000×1000×820","1000×800×850","1900×800×850"]    // 文本
                                }                                
                            ],
                            // 右边盒子
                            boxRight:[    
                                {
                                    width:12,    // 宽 （单位是 标尺）
                                    height:11,   // 高  （单位是 标尺）
                                    top:0,       // 距离上  （单位是 标尺）
                                    left:0,      // 距离左  （单位是 标尺）
                                    text:["1勤劳 → 一工厂","木质铲板×3","1000×1000×820","1000×800×850"]    // 文本
                                },
                                {
                                    width:11,    // 宽 （单位是 标尺）
                                    height:11,   // 高  （单位是 标尺）
                                    top:0,       // 距离上  （单位是 标尺）
                                    left:12,      // 距离左  （单位是 标尺）
                                    text:["1勤劳 → 一工厂","木质铲板×3","1000×1000×820","1000×800×850","1900×800×850"]    // 文本
                                },
                                {
                                    width:11,    // 宽 （单位是 标尺）
                                    height:11,   // 高  （单位是 标尺）
                                    top:24-11,       // 距离上  （单位是 标尺）
                                    left:0,      // 距离左  （单位是 标尺）
                                    text:["1勤劳 → 一工厂","木质铲板×3","1000×1000×820","1000×800×850","1900×800×850"]    // 文本
                                },
                                {
                                    width:11,    // 宽 （单位是 标尺）
                                    height:11,   // 高  （单位是 标尺）
                                    top:24-11,       // 距离上  （单位是 标尺）
                                    left:11,      // 距离左  （单位是 标尺）
                                    text:["1勤劳 → 一工厂","木质铲板×3","1000×1000×820","1000×800×850","1900×800×850"]    // 文本
                                }                                                                                                  
                            ]                            
                        },
                        {
                            titleLeft:"车头—F5",   // 左边 标题
                            titleRight:"车尾—F5",  // 右边边 标题
                            storageX:25,    // 货架区域 x 轴标尺数
                            scaleX:95,   // x 轴标尺数
                            scaleY:37,   // y 轴标尺数
                            // 左边盒子
                            boxLeft:[    
                                {
                                    width:10,    // 宽 （单位是 标尺）
                                    height:10,   // 高  （单位是 标尺）
                                    top:0,       // 距离上  （单位是 标尺）
                                    left:0,      // 距离左  （单位是 标尺）
                                    background: "rgba(0,255,0,1)",   // 颜色
                                    text:["1勤劳 → 一工厂","木质铲板×3","1000×1000×820","1000×800×850"]    // 文本
                                },
                                {
                                    width:11,    // 宽 （单位是 标尺）
                                    height:10,   // 高  （单位是 标尺）
                                    top:37-10,       // 距离上  （单位是 标尺）
                                    left:0,      // 距离左  （单位是 标尺）
                                    text:["1勤劳 → 一工厂","木质铲板×3","1000×1000×820","1000×800×850","1900×800×850"]    // 文本
                                }                                
                            ],
                            // 右边盒子
                            boxRight:[    
                                {
                                    width:12,    // 宽 （单位是 标尺）
                                    height:11,   // 高  （单位是 标尺）
                                    top:0,       // 距离上  （单位是 标尺）
                                    left:0,      // 距离左  （单位是 标尺）
                                    background: "rgba(0,255,255,1)",   // 颜色
                                    text:["1勤劳 → 一工厂","木质铲板×3","1000×1000×820","1000×800×850"]    // 文本
                                },
                                {
                                    width:11,    // 宽 （单位是 标尺）
                                    height:11,   // 高  （单位是 标尺）
                                    top:0,       // 距离上  （单位是 标尺）
                                    left:12,      // 距离左  （单位是 标尺）
                                    text:["1勤劳 → 一工厂","木质铲板×3","1000×1000×820","1000×800×850","1900×800×850"]    // 文本
                                }                                                                                                 
                            ]                            
                        }
                    ]
                },
                {
                    // 头部
                    head:{
                        title:"大金MilkRun【闵行线路】H1车次-装车示意图-测试数据",   // 标题
                        date:"2020/7/8 8:30:00-测试数据",   // 交货日期
                        area:"1-3-测试数据",   // 车辆区分
                        principal:"张三 2020/07/08测试"  // 负责人
                    },
                    // 车厢 可以多个
                    children:[
                        {
                            titleLeft:"车头—F5",   // 左边 标题
                            titleRight:"车尾—F5",  // 右边边 标题
                            storageX:28,    // 货架区域 x 轴标尺数
                            scaleX:85,   // x 轴标尺数
                            scaleY:24,   // y 轴标尺数
                            // 左边盒子
                            boxLeft:[    
                                {
                                    width:10,    // 宽 （单位是 标尺）
                                    height:10,   // 高  （单位是 标尺）
                                    top:0,       // 距离上  （单位是 标尺）
                                    left:0,      // 距离左  （单位是 标尺）
                                    text:["1勤劳 → 一工厂","木质铲板×3","1000×1000×820","1000×800×850"]    // 文本
                                },
                                {
                                    width:11,    // 宽 （单位是 标尺）
                                    height:10,   // 高  （单位是 标尺）
                                    top:0,       // 距离上  （单位是 标尺）
                                    left:10,      // 距离左  （单位是 标尺）
                                    text:["1勤劳 → 一工厂","木质铲板×3","1000×1000×820","1000×800×850","1900×800×850"]    // 文本
                                }                                
                            ],
                            // 右边盒子
                            boxRight:[    
                                {
                                    width:12,    // 宽 （单位是 标尺）
                                    height:11,   // 高  （单位是 标尺）
                                    top:0,       // 距离上  （单位是 标尺）
                                    left:0,      // 距离左  （单位是 标尺）
                                    text:["1勤劳 → 一工厂","木质铲板×3","1000×1000×820","1000×800×850"]    // 文本
                                },
                                {
                                    width:11,    // 宽 （单位是 标尺）
                                    height:11,   // 高  （单位是 标尺）
                                    top:24-11,       // 距离上  （单位是 标尺）
                                    left:12,      // 距离左  （单位是 标尺）
                                    text:["22勤劳 → 一工厂","木质铲板×3","1000×1000×820","1000×800×850","1900×800×850"]    // 文本
                                }                                                                                                 
                            ]                            

                        }
                    ]
                }
            ]
        }
    },
               
    methods: {
        /**
         *  初始化
         */
        initPage: function(){
            // 请求数据 替换 config
        }
    },
}
</script>